# PANDAS Assignment - 1) Count Distance to Previous Zero

In [819]:
import pandas as pd
def distanceFromZero(data):
    x=0
    y=[]
    df1 = pd.DataFrame(data,columns=['X'])
    for row in df1.itertuples():
        if row.X==0 or row.Index==0:
            x=0
        else:
            x=x+1
        y.append(x)
    df2=df1.assign(Y=y)
    return df2

In [2]:
distanceFromZero([7, 2, 0, 3, 4, 2, 5, 0, 3, 4])

   X  Y
0  7  0
1  2  1
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

#  Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers.

In [820]:
import pandas as pd
import numpy as np
dateAr=pd.date_range('2018-01-01','2018-12-31',freq='B')
df1 = pd.DataFrame({'A1':np.random.randint(261,size=261),'B1':dateAr,'C1':dateAr.weekday})
df1.head(5)

    A1         B1  C1
0  187 2018-01-01   0
1   43 2018-01-02   1
2  164 2018-01-03   2
3  196 2018-01-04   3
4  211 2018-01-05   4

# Find the sum of the values in s for every Wednesday

In [821]:
dfSum=df1.query('C1==2').groupby('C1').sum()
print("Sum of Wednesdays is:\n")
dfSum

Sum of Wednesdays is:

      A1
C1
2   6504

# Average For each calendar month

In [822]:
dfMean=df1[['B1','A1']].groupby(pd.Grouper(key='B1',freq='M')).mean()
print("Mean for every Month is:\n")
dfMean

Mean for every Month is:

                    A1
B1
2018-01-31  120.739130
2018-02-28  134.550000
2018-03-31  134.000000
2018-04-30  116.714286
2018-05-31  157.782609
2018-06-30  126.952381
2018-07-31  151.272727
2018-08-31  132.260870
2018-09-30  139.050000
2018-10-31  135.086957
2018-11-30  126.909091
2018-12-31  124.476190

# For each group of four consecutive calendar months in s, find the date on which the highest value occurred.

In [818]:
df2=df1.assign(Quadmester=lambda x:((dateAr.month-1)//4))
dfMax=df2.groupby('Quadmester')['A1','Quadmester'].max()
dfMax.set_index(['A1','Quadmester'],inplace=True)
df2.set_index(['A1','Quadmester'],inplace=True)
dfMax.join(df2,how='left', lsuffix='_l',rsuffix='_r').

                       B1  C1
A1  Quadmester
251 2          2018-12-06   3
254 1          2018-05-17   3
258 0          2018-01-12   4